import { createContext } from "react";

export const BlogContext = createContext(null);

const BlogContextProvider = ({ children }) => {
  const albums = ["Cricket", "Football", "Tennis"];
  const images = [
    {
      image: "/img1.jpg",
      category: "Cricket",
    },
    {
      image: "/img1.jpg",
      category: "Cricket",
    },
    {
      image: "/img1.jpg",
      category: "Football",
    },
    {
      image: "/img1.jpg",
      category: "Tennis",
    },
    {
      image: "/img1.jpg",
      category: "Football",
    },
  ];
  const posts = [
    {
      id: 1,
      image: "/img1.jpg",
      title: "Ensuring Safe and Clean Seating Areas to Combat Dengue",
      content:
        "As a part of our commitment to creating a cleaner, healthier campus, members of the CPI Timeline have launched the Better CPI Initiative. Our first project under this initiative focuses on cleaning and securing student seating areas to reduce the spread of dengue—a critical health issue in our community.With monsoon season bringing an increase in mosquito-borne diseases, particularly dengue, our campus is vulnerable. Recognizing this, we took proactive measures to make the student seating area in front of the student union office safe and hygienic. Our project aims to not only clean these areas but also raise awareness about the importance of maintaining cleanliness in public spaces to prevent dengue.Through this effort, we strive to inspire others to join us in keeping our campus spotless and safe. Let’s all be part of the solution. Together, we can cultivate a more aware, responsible, and health-conscious student community. 🌿Join us in making our campus a dengue-free zone—one step at a time.",
    },
    {
      id: 2,
      image: "/img1.jpg",
      title:
        "'মাঠ সংস্কার' -Better CPI Initiative-এর একটি গুরুত্বপূর্ণ পদক্ষেপ",
      content: `
    আমাদের প্রিয় ক্যাম্পাসে সাধারণ শিক্ষার্থীদের জন্য খেলাধুলা এবং বিনোদনের একমাত্র খোলা জায়গা, সেন্ট্রাল মাঠ, এখন সংস্কারের কাজের আওতায় এসেছে। "Better CPI Initiative"-এর অন্যতম প্রধান লক্ষ্য ছিল এই মাঠের মান উন্নয়ন এবং এটি নিরাপদ ও ব্যবহারযোগ্য করে তোলা। আমরা খুবই আনন্দিত যে, চিটাগাং পলিটেকনিক ইনস্টিটিউটের প্রশাসন আমাদের এই উদ্যোগকে গুরুত্ব দিয়ে মাঠের সংস্কার কাজ শুরু করেছে।
    
    কেন প্রয়োজন মাঠ সংস্কার?
    সেন্ট্রাল মাঠ আমাদের ক্যাম্পাসের প্রাণকেন্দ্র, যেখানে শিক্ষার্থীরা খেলাধুলা, হাঁটাহাঁটি এবং নানা আয়োজন করতে পারে। তবে দীর্ঘদিন ধরে এটি অবহেলিত থাকায় মাঠটি খেলার জন্য উপযোগী ছিল না এবং শিক্ষার্থীদের বিনোদন ও শরীরচর্চার সুযোগ বাধাগ্রস্ত হচ্ছিল। এই সংস্কারের মাধ্যমে মাঠটি আরও সবুজ, সমতল এবং সবার জন্য নিরাপদ হয়ে উঠবে। 
    
    ভবিষ্যৎ পরিকল্পনা এবং শিক্ষার্থীদের উপকার
    Better CPI Initiative-এর এই পদক্ষেপটি শুধু মাঠ সংস্কারেই সীমাবদ্ধ নয়। এটি আমাদের ক্যাম্পাসকে আরও সুন্দর এবং শিক্ষার্থীবান্ধব করতে বিভিন্ন উদ্যোগ গ্রহণের একটি অংশ। আমরা বিশ্বাস করি, এই মাঠ সংস্কারের ফলে শিক্ষার্থীরা আরও বেশি শরীরচর্চা এবং খেলাধুলায় মনোযোগ দিতে পারবে, যা তাদের মানসিক ও শারীরিক স্বাস্থ্যের উন্নতিতে সহায়ক হবে।
    
    চপই প্রশাসনের প্রতি কৃতজ্ঞতা
    আমাদের এই উদ্যোগকে স্বীকৃতি দেওয়ার এবং মাঠ সংস্কারে সহায়তা করার জন্য চপই প্রশাসনের প্রতি আন্তরিক ধন্যবাদ। তাদের সমর্থন ছাড়া এ কাজ সম্ভব হতো না।
    
    আসুন, আমরা সকলে মিলে এই উদ্যোগের সাফল্যে অবদান রাখি এবং আমাদের ক্যাম্পাসকে একটি পরিচ্ছন্ন, নিরাপদ এবং শিক্ষার্থীবান্ধব স্থানে পরিণত করি। Better CPI Initiative-এর পক্ষ থেকে, সবার প্রতি আহ্বান—আসুন, সকলে মিলে আমাদের ক্যাম্পাসকে আরও সুন্দর এবং সমৃদ্ধ করি।
  `,
    },

    {
      id: 3,
      image: "/img1.jpg",
      title: "টিম CPI Timeline: আমাদের ক্যাম্পাস, আমাদের গর্ব, আমাদের দায়িত্ব",
      content:
        "টিম CPI Timeline চট্টগ্রাম পলিটেকনিক ইনস্টিটিউটের একটি স্বতন্ত্র সামাজিক সংগঠন, যা আমাদের ক্যাম্পাসের ইতিহাস, সাহিত্য, সংস্কৃতি ও ঐতিহ্যের প্রতিনিধিত্ব করতে কাজ করে। শিক্ষার্থীদের স্বার্থ রক্ষায় মিডিয়া সেল হিসেবে ভূমিকা পালনের পাশাপাশি এই টিমের মূল লক্ষ্য হল সত্য ও ন্যায়ের পথে থেকে ক্যাম্পাসে একটি ন্যায়নিষ্ঠ ও সুস্থ পরিবেশ তৈরি করা। টিম CPI Timeline-এর উদ্দেশ্য ও মূল্যবোধ: প্রতিষ্ঠার পর থেকে, টিম CPI Timeline ক্যাম্পাসভিত্তিক বিভিন্ন সামাজিক ও সাংস্কৃতিক কার্যক্রমের মাধ্যমে সাধারণ শিক্ষার্থীদের অধিকার আদায়ের চেষ্টা করে যাচ্ছে। আমরা মনে করি, দলীয় স্বার্থ বা বিভাজন নয়, বরং একতা, সততা ও সুন্দর চিন্তার মাধ্যমে আমরা আমাদের প্রিয় ক্যাম্পাসকে আরও উন্নত করতে পারি। আমাদের উদ্দেশ্য শুধুমাত্র একটি মিডিয়া সেল হিসেবে কাজ করা নয়, বরং সবার কাছে ক্যাম্পাসের সঠিক তথ্য, বাস্তব চিত্র ও ঘটনাগুলো তুলে ধরার মাধ্যম হিসেবেও কাজ করা। একটি সুন্দর ক্যাম্পাস গঠনে আমাদের ভূমিকা: সাহিত্য, ইতিহাস ও ঐতিহ্যের প্রতি ভালোবাসা এবং শিক্ষার্থীদের কল্যাণের স্বার্থে বিভিন্ন কার্যক্রমের আয়োজন করাই আমাদের কাজের মূল ভিত্তি। Better CPI Initiative প্রজেক্টের মাধ্যমে ডেঙ্গু প্রতিরোধ, মাঠ সংস্কার এবং বসার স্থান পরিষ্কারকরণের মতো কার্যক্রম আমরা বাস্তবায়ন করছি। আমাদের বিশ্বাস, এসব উদ্যোগের মাধ্যমে ক্যাম্পাসে একটি পরিচ্ছন্ন ও সুস্থ পরিবেশ তৈরি করা সম্ভব, যেখানে শিক্ষার্থীরা আনন্দের সাথে পড়াশোনা করতে পারবে। আগামীর পরিকল্পনা: টিম CPI Timeline ভবিষ্যতেও ক্যাম্পাসের সৌন্দর্য ও শিক্ষার্থীদের অধিকার রক্ষায় অঙ্গীকারবদ্ধ। আমরা আরও বিভিন্ন উদ্যোগ গ্রহণের মাধ্যমে শিক্ষার্থীদের সচেতনতা বৃদ্ধি করতে চাই, যাতে ক্যাম্পাস একটি নিরাপদ ও সমৃদ্ধ স্থান হিসেবে প্রতিষ্ঠিত হতে পারে। আমরা বিশ্বাস করি, সুন্দর ভবিষ্যতের জন্য সৎ চিন্তা এবং ন্যায়ের পক্ষে কাজ করাই একমাত্র সঠিক পথ। সবার প্রতি আহ্বান: সত্যের পথে টিম CPI Timeline-এর এই যাত্রায় সকল শিক্ষার্থী ও শুভাকাঙ্ক্ষীদের পাশে থাকার জন্য আহ্বান জানাচ্ছি। একসাথে গড়ে তুলি একটি ন্যায়নিষ্ঠ, সুষ্ঠু ও সুন্দর ক্যাম্পাস, যেখানে সকলের অধিকার নিশ্চিত হবে এবং ক্যাম্পাস হয়ে উঠবে এক উজ্জ্বল দৃষ্টান্ত। - টিম CPI Timeline",
    },

    {
      id: 4,
      image: "/img1.jpg",
      title: "চট্টগ্রাম পলিটেকনিক ইনস্টিটিউট -এর পরিচিতি",
      content:
        "চট্টগ্রাম পলিটেকনিক ইনস্টিটিউট, কারিগরি শিক্ষার এক অন্যতম প্রতিষ্ঠান, ১৯৬২ সালে প্রতিষ্ঠিত হয়। সরকারি এই প্রতিষ্ঠানটি বাংলাদেশ কারিগরি শিক্ষা বোর্ডের অধীনে এবং শিক্ষা মন্ত্রণালয়ের কারিগরি ও মাদ্রাসা শিক্ষা বিভাগের তত্ত্বাবধানে পরিচালিত হয়। প্রতিষ্ঠানটি ৩৫ একর জমির উপর অবস্থিত এবং প্রায় ৪২০০ শিক্ষার্থী এখানে চার বছরের ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং কোর্সে অধ্যয়নরত। প্রতিষ্ঠান কোড ৭০০৪৮। প্রতিষ্ঠানে ৩২টি ক্লাসরুম, ১১টি ওয়ার্কশপ এবং ১৭টি ল্যাব রয়েছে। বিভিন্ন টেকনোলজির জন্য রয়েছে পৃথক ল্যাব যেমন বেসিক ইলেকট্রনিক্স, অ্যাডভান্স ইলেকট্রনিক্স, কম্পিউটার, কেমিস্ট্রি এবং ফিজিক্স ল্যাব। শিক্ষার্থীরা মেটাল শপ, কাঠের দোকান, পাওয়ার শপ ইত্যাদি কর্মশালায় ব্যবহারিক প্রশিক্ষণ লাভ করে। চট্টগ্রাম পলিটেকনিক ইনস্টিটিউটে রোভার স্কাউটদের একটি দল রয়েছে এবং প্রতি সেমিস্টারের ৬৫% শিক্ষার্থী সরকারি বৃত্তি পেয়ে থাকে। ##ক্যাম্পাসের পরিবেশ## ক্যাম্পাসে একাধিক ভবন রয়েছে, যার মধ্যে রয়েছে তিন তলা, একতলা, ও দু'তলা একাডেমিক এবং প্রশাসনিক ভবন। এছাড়াও রয়েছে একটি ৪০০ আসন বিশিষ্ট অডিটোরিয়াম, লাইব্রেরি, কনফারেন্স রুম, মসজিদ, শহীদ মিনার, এবং মনোরম ফোয়ারা। মূল ভবনের সামনে ইলিশ চত্বর ও দোয়েল চত্বর, সাইকেল স্ট্যান্ড এবং খেলার মাঠ রয়েছে। সব মিলিয়ে এটি একটি মনোরম পরিবেশে অবস্থিত, যা শিক্ষার্থীদের মানসিক ও শারীরিক উন্নয়নে সহায়ক ভূমিকা রাখে। ##টেকনোলজি / বিভাগ সমূহ## চট্টগ্রাম পলিটেকনিক ইনস্টিটিউটে শিক্ষার্থীদের জন্য রয়েছে সিভিল, ইলেকট্রিক্যাল, মেকানিক্যাল, পাওয়ার, ইলেকট্রনিক্স, কম্পিউটার সাইন্স এন্ড টেকনোলজি, এনভায়নমেন্ট এবং নন-টেক বিভাগ। ##প্রতিষ্ঠানে ৪টি ছেলেদের ও ১টি মেয়েদের জন্য হোস্টেল রয়েছে: মাস্টার দা সূর্য সেন হল (২)কবি কাজী নজরুল ইসলাম হল (৩)নবাব সিরাজ উদ দৌলা হল (৪)শহিদুল্লাহ হল (৫)প্রীতিলতা হল (মেয়েদের জন্য)।।",
    },
  ];

  const value = { albums, images, posts };

  return <BlogContext.Provider value={value}>{children}</BlogContext.Provider>;
};

export default BlogContextProvider;
